from ALL123 import *
b=[1,2,3]
alist=[[1,2,3],
       [4,5,6],
       [7,8,9],
       [5,6,7]]
k=4
hello()
import time
st=time.time()#start time
ans= 'y'
while  ans == 'y':
    print("\tღღღღღღღღ405031543*******************************************************************")
    print("\tღღღღღღღღ 1.GUESSNUMBER   ********************************************************************")
    print("\t*ღღღღღღღ 2.HELLO         ********************************************************************")
    print("\tღღღღღღღღ 3.BMI          *********************************************************************")
    print("\tღღღღღღღღ4.剪刀石頭布************************************************************************")
    print("\tღღღღღღღღ5. 輸入三位數,計算其總和   *********************************************************")
    print("\tღღღღღღღღ6.輸入四位數,印出其倒數       ******************************************************")
    print("\tღღღღღღღღ 7.攝氏轉華氏,華氏轉攝氏         ****************************************************")
    print("\tღღღღღღღღ8.確認八位數密碼是否為密碼**********************************************************")
    print("\tღღღღღღღღ9猜英文字母*************************************************************************")
    print("\tღღღღღღღღ10.輸入一個單字,在輸入一個字母,確認有幾個字母在其中       **************************")
    print("\tღღღღღღღღ11.玩十點半       ******************************************************************")
    print("\tღღღღღღღღ12.將串列[1,2,3],[3,4,5],[5,6,7]結合在一起       ***********************************")
    print("\tღღღღღღღღ13.將[[60,70,80,90], [99,66,77,88],[77,88,67,97],[60,80,95,61]] 每行加總      ******")
    print("\tღღღღღღღღ14.計算平均分數,最大值和最小值      ************************************************")
    print("\tღღღღღღღღ15.頭尾對調      *******************************************************************")
    print("\tღღღღღღღღ16.[[1,2,3],[4,5,6],[7,8,9],[5,6,7]]陣列row總和      *******************************")
    print("\tღღღღღღღღ17.[[1,2,3],[4,5,6],[7,8,9],[5,6,7]]陣列column總和      ****************************")
    print("\tღღღღღღღღ18.[[1,2,3],[4,5,6],[7,8,9],[5,6,7]]陣列row總和第二種方式      *********************")
    print("\tღღღღღღღღ19.猜生日      *********************************************************************")
    print("\tღღღღღღღღ20.對矩陣中所有對角線上的所有元素做加總     ****************************************")
    print("\tღღღღღღღღ21.讀取3*4的矩陣,並顯示各行的元素總和      *****************************************")
    print("\tღღღღღღღღ22.列出心得      *******************************************************************")
    print("\tღღღღღღღღ23.猜猜abc      ********************************************************************")
    print("\tღღღღღღღღ24.猜1-20數字,可以重複玩喔     *****************************************************")
    print("\tღღღღღღღღ25.只能猜5次,請猜出英文字母     ****************************************************")
    print("\tღღღღღღღღ26.樂透模擬開獎(猜號碼1-20)     ****************************************************")
    
    sel =eval(input("pls select 1~26, 0 to exit"))
   

    if  sel==0 :
        break
    if  sel==1 :
        guessnumber()
    elif sel ==2 :
        hello()
    elif sel==3 :
        bmi()
    elif sel ==4 :
        srp()
    elif sel==5 :
        subdigist()
    elif sel ==6 :
        reverse()
    elif sel==7 :
        ce()
    elif sel ==8 :
        checkpass()
    elif sel==9:
        guessabc()
    elif sel==10 :
        countletter()
    elif sel==11 :
         十點半()
    elif sel==12 :    
        score()
    elif sel==13:    
        score1()
    elif sel==14:
        main()
    elif sel==15:
        reve(b)
    elif sel==16:
        counta(alist,k)
    elif sel==17:
        countb(alist,k)
    elif sel==18:
        countc(alist,k)
    elif  sel==19:
        birthday()
    elif  sel==20:
        main1()
    elif  sel==21:
        main3()
    elif  sel==22:
        auto()
    elif  sel==23:
        guessabc123()
    elif  sel==24:
        guesslot()
    elif  sel==25:
        guessabc()
    elif  sel==26:
        樂透()
    else:
        break

    ans=input("continue ? y/n")

et=time.time()
tt=et-st
print("你玩的時間花了",round(tt),"秒")
kk=input("請按\enter\鍵離開")

